Revit 2027 API
ExporterIFC.PushExportState Method
 Sets the internal state of the exporter to process the geometry and properties of the input element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PushExportState(
	Element Elem,
	GeometryElement GRep
)
Public Sub PushExportState (
	Elem As Element,
	GRep As GeometryElement
)
public:
void PushExportState(
	Element^ Elem,
	GeometryElement^ GRep
)
member PushExportState :
        Elem : Element *
        GRep : GeometryElement -> unit
Parameters
Elem Element
 The element.
GRep GeometryElement
 The geometry of the element. Optional, can be null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The element will be assigned until PopExportState() is called.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace